; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=8, locations=11, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=17, seed=58

(define (problem transport-17)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l8)
    (at p3 l7)
    (at p4 l6)
    (at p5 l5)
    (at p6 l5)
    (at p7 l8)
    (at p8 l10)
    (at v1 l7)
    (at v2 l5)
    (at v3 l10)
    (at v4 l2)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l4)
    (at p3 l8)
    (at p4 l2)
    (at p5 l8)
    (at p6 l9)
    (at p7 l11)
    (at p8 l7))))

; plan
1. (pick-up v3 l10 p8 c0 c1)
   deleted: (at p8 l10) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 0 of 8
2. (drive v3 l10 l7)
   deleted: (at v3 l10)
   added: (at v3 l7)
   goals met: 0 of 8
3. (pick-up v2 l5 p6 c0 c1)
   deleted: (at p6 l5) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 0 of 8
4. (drive v2 l5 l9)
   deleted: (at v2 l5)
   added: (at v2 l9)
   goals met: 0 of 8
5. (drop v2 l9 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l9) (capacity v2 c1)
   goals met: 1 of 8
6. (drive v4 l2 l6)
   deleted: (at v4 l2)
   added: (at v4 l6)
   goals met: 1 of 8
7. (pick-up v4 l6 p4 c0 c1)
   deleted: (at p4 l6) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 1 of 8
8. (drive v4 l6 l2)
   deleted: (at v4 l6)
   added: (at v4 l2)
   goals met: 1 of 8
9. (drop v4 l2 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l2) (capacity v4 c1)
   goals met: 2 of 8
10. (drop v3 l7 p8 c0 c1)
   deleted: (in p8 v3) (capacity v3 c0)
   added: (at p8 l7) (capacity v3 c1)
   goals met: 3 of 8
11. (drive v3 l7 l8)
   deleted: (at v3 l7)
   added: (at v3 l8)
   goals met: 3 of 8
12. (drive v3 l8 l4)
   deleted: (at v3 l8)
   added: (at v3 l4)
   goals met: 3 of 8
13. (pick-up v3 l4 p1 c0 c1)
   deleted: (at p1 l4) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 3 of 8
14. (drive v3 l4 l1)
   deleted: (at v3 l4)
   added: (at v3 l1)
   goals met: 3 of 8
15. (drop v3 l1 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l1) (capacity v3 c1)
   goals met: 4 of 8
16. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 4 of 8
17. (pick-up v1 l8 p2 c0 c1)
   deleted: (at p2 l8) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 4 of 8
18. (drive v2 l9 l8)
   deleted: (at v2 l9)
   added: (at v2 l8)
   goals met: 4 of 8
19. (drive v2 l8 l11)
   deleted: (at v2 l8)
   added: (at v2 l11)
   goals met: 4 of 8
20. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 4 of 8
21. (drop v1 l4 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l4) (capacity v1 c1)
   goals met: 5 of 8
22. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 5 of 8
23. (pick-up v1 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 5 of 8
24. (drive v1 l5 l8)
   deleted: (at v1 l5)
   added: (at v1 l8)
   goals met: 5 of 8
25. (drop v1 l8 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l8) (capacity v1 c1)
   goals met: 6 of 8
26. (pick-up v1 l8 p7 c0 c1)
   deleted: (at p7 l8) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 8
27. (drive v2 l11 l7)
   deleted: (at v2 l11)
   added: (at v2 l7)
   goals met: 6 of 8
28. (pick-up v2 l7 p3 c0 c1)
   deleted: (at p3 l7) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 6 of 8
29. (drive v2 l7 l8)
   deleted: (at v2 l7)
   added: (at v2 l8)
   goals met: 6 of 8
30. (drop v2 l8 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l8) (capacity v2 c1)
   goals met: 7 of 8
31. (drive v1 l8 l11)
   deleted: (at v1 l8)
   added: (at v1 l11)
   goals met: 7 of 8
32. (drop v1 l11 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l11) (capacity v1 c1)
   goals met: 8 of 8
